x1命中率
x1%伤害 
x1命中率，x2%伤害 
x1%防御力 
x1防御等级
x1防御值
x1火焰抗性 
x1闪电抗性 
x1魔法抗性 
x1所有抗性
(空)
法术等级x1级
额外充能
(x1 ~ x2)法术充能
(x1 ~ x2)近战火焰伤害
(x1 ~ x2)近战闪电伤害
x1力量属性
x1魔法属性
x1敏捷属性
x1体力属性
x1所有属性
x1来自敌人的伤害值
x1生命值
x1魔法值
耐久度高
耐久度降低
无法损坏
x1%光照范围
x1%光照范围
多重射击
(x1 ~ x2)火箭伤害
(x1 ~ x2)闪电箭伤害
火球伤害x1
+25％对不死族造成的近战总伤害
失去所有再生能力
无法治疗
吸收33%的远程攻击伤害
将目标击退
+25％对恶魔造成的近战总伤害
失去所有抗性
专注持续时间
近战偷取1％ ~ 2%法力
近战偷取1％ ~ 2%生命
穿甲能力x1％
攻击速度最快
击中恢复最快
格挡速度最快
增加 x1 物理伤害
射出的箭矢速度随机
不同寻常的基础伤害x1
耐久度与众不同
攻击速度更快
单手武器
基础生命再生速度翻倍
随机增加吸血效果
无需力量要求
感知能力增强
(空)
闪电伤害(x1 ~ x2)
击中时释放充能箭(火，雷)
30%的几率造成+50%的伤害
衰减x1%的伤害
基础魔法再生速度翻倍
80-150％随机伤害
低耐久度，+140％伤害
-25％魔法消耗
+20对恶魔的护甲
+15对不死族的护甲
50％魔法值转到生命值
40％生命值转移到魔法值
x1％金币收益
(x1 ~ x2)金币收益
x1％找到魔法物品的几率
(空)
(空)
(空)
(空)
(空)
无效果x1，几率x1%
x1%无效果伤害，x1命中率
x1无效果伤害，x1命中率 
(x1 ~ x2)奥术箭伤害
(x1 ~ x2)圣洁箭伤害
(x1 ~ x2)酸性箭伤害
最快施法速度
x1％所有属性
x1％力量属性
x1％敏捷属性
x1％魔法属性
x1％体力属性
x1生命再生速度
x1魔法再生速度
x1％生命再生速度
x1％魔法再生速度
(x1 ~ x2)获得经验
x1％获得经验
x1近战伤害抗性
x1弓箭伤害抗性
x1％召唤的随从生命值
x1％召唤的随从伤害
x1％召唤的随从护甲值
x1召唤的随从的命中率
x1召唤的随从的生命值
x1召唤的随从的伤害
x1召唤的随从的护甲值
x1％格挡几率
x1％暴击几率
x1％暴击伤害
x1％暴击伤害，x1％暴击几率
x1暴击伤害
(空)
(空)
(空)
(空)
(空)
(空)
生命值x1％
魔法值x1％
(空)
x1物理抗性
x1％攻击速度(没效果)
x1％施法速度(没效果)
x1％荆棘伤害
x1晕眩阈值
(x1 ~ x2)奥术近战伤害
(x1 ~ x2)神圣近战伤害
(x1 ~ x2)酸性近战伤害
需要角色等级x1
(x1 ~ x2)冰霜近战伤害
(x1 ~ x2)冰霜箭伤害